#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AWS_CloudResume/AWS_CloudResume_backend/runs/run-YHDTchTPnDnb7Gpa

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
data.template_file.dynamoDBlambdapolicy: Refreshing...
data.template_file.dynamoDBlambdapolicy: Refresh complete after 0s [id=58f2b613eb693184953ea01e077e005a252bc538d7ee8622cd8d35a16892bd62]
data.archive_file.zip_the_python_code: Refreshing...
data.archive_file.zip_the_python_code: Refresh complete after 0s [id=d209a3a0dca59603939e5ee24dc348f6788d73d8]
aws_api_gateway_api_key.visitor_api_key: Refreshing state... [id=ql89auiala]
aws_iam_policy.DynamoDBLambdaPolicy: Refreshing state... [id=arn:aws:iam::041912853286:policy/DynamoDBLambdaPolicy]
aws_iam_role.DynamoDBLambdaRole: Refreshing state... [id=DynamoDBLambdaRole]
aws_api_gateway_rest_api.visitorCounter: Refreshing state... [id=7hn5blxzxg]
aws_dynamodb_table.visitor_table: Refreshing state... [id=visitor_count]
aws_dynamodb_table_item.add_item_dynamodb: Refreshing state... [id=visitor_count|visitorCount||user|]
aws_api_gateway_resource.cors_resource: Refreshing state... [id=7xtd31]
aws_iam_role_policy_attachment.DynamoDBLambdaRolePolicy: Refreshing state... [id=DynamoDBLambdaRole-20230418001706109600000001]
aws_lambda_function.DynamoDBVisitorFunction: Refreshing state... [id=Visitor_Counter_Lambda_Function]
aws_api_gateway_method.increment_visitors_method: Refreshing state... [id=agm-7hn5blxzxg-7xtd31-POST]
aws_api_gateway_method.options_method: Refreshing state... [id=agm-7hn5blxzxg-7xtd31-OPTIONS]
aws_api_gateway_method_response.options_200: Refreshing state... [id=agmr-7hn5blxzxg-7xtd31-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-7hn5blxzxg-7xtd31-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-7hn5blxzxg-7xtd31-POST-200]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-7hn5blxzxg-7xtd31-OPTIONS-200]
aws_lambda_permission.apigw-visitCounter: Refreshing state... [id=terraform-20230418003634324300000001]
aws_api_gateway_integration.lambda_visitor_integration: Refreshing state... [id=agi-7hn5blxzxg-7xtd31-POST]
aws_api_gateway_deployment.visitor_api_deployment: Refreshing state... [id=b2scxa]
aws_api_gateway_integration_response.VisitorIntegrationResponse: Refreshing state... [id=agir-7hn5blxzxg-7xtd31-POST-200]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-7hn5blxzxg-default]
aws_api_gateway_usage_plan.incrementVisitor-UsagePlan: Refreshing state... [id=z8iuk2]
aws_api_gateway_usage_plan_key.main: Refreshing state... [id=ql89auiala]
aws_dynamodb_table_item.add_item_dynamodb: Drift detected (update)
aws_api_gateway_stage.api_stage: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.visitor_api_deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "visitor_api_deployment" {
      ~ created_date  = "2023-04-18T00:36:34Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:041912853286:7hn5blxzxg/" -> (known after apply)
      ~ id            = "b2scxa" -> (known after apply)
      ~ invoke_url    = "https://7hn5blxzxg.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "2ba9fc616828daece916cfc9c0bdf25c4da6f52a" -> "da9ec776ddaa3698e09f21b98dc36b975119ddae"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "yx52az" -> (known after apply)
        id                    = "ags-7hn5blxzxg-default"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @Stephanie-Chester, Action: `pull_request`*